TEDS-2023/Taller 4/investigacion pruebas de usuario.tex
% Created 2023-09-10 dom 10:34
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{../modern}
\bibliography{./fuentes.bib}
\raggedbottom
\setcounter{secnumdepth}{2}
\author{Luis Eduardo Galidno Amaya}
\date{10 Septiembre del 2023}
\title{Investigación pruebas de usuario}
\hypersetup{
 pdfauthor={Luis Eduardo Galidno Amaya},
 pdftitle={Investigación pruebas de usuario},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={Spanish}}
\begin{document}

\modentitlepage{../images/escudo-uabc-2022-1-tinta-pos.png}
\tableofcontents\pagebreak
\datasection{Individual}

\section{Introducción}
\label{sec:org7e284f0}
En esta taller se ralizara una investigacion de pruebas de usaurio, conocer
como el software puede ser usado por el usuario es muy importante ya que esto
puede mostrar fallos que no son faciles de detectar en las primeras fases de 
desarollo.

\section{Pruebas de usuario}
\label{sec:org1e4f29d}
\autocite{Narvaez_2023} Una prueba con usuarios o test con usuarios es un 
método para evaluar la funcionalidad y la interfaz de un sitio web, una 
aplicación, un producto o un servicio haciendo que usuarios reales realicen 
tareas específicas en él en condiciones realistas. 

\section{Importancia de las pruebas de usuario}
\label{sec:org5b410b3}
\autocite{Abizanda_2023} Los tests con usuarios son una prueba que nos
permite recoger información cualitativa para entender, principalmente, cómo y 
por qué los usuarios utilizan un producto.

Durante el test se pide a los usuarios realizar una serie de tareas para
interactuar con el producto, lo que nos permite descubrir:

\begin{itemize}
\item Cómo navegan por el producto
\item Por qué llevan a cabo ciertas acciones
\item Con qué problemas se encuentran
\item Qué valoran positivamente
\item Cuántos funcionalidades o aspectos echan en falta
\end{itemize}

Estos insights, entre otros, nos permiten mejorar el producto para conseguir 
que la experiencia del usuario al utilizarlo sea la mejor posible, e incluso 
conseguir que les encante nuestro producto.

\section{Como realizar pruebas de usuario}
\label{sec:org87fdab6}
\autocite{Abizanda_2023}

\begin{itemize}
\item 1. Definir los objetivos
\item 2. Decidir el tipo de test
\item 3. Disponer del producto a testar
\item 4. Identificar los tipos de perfiles de usuario
\item 5. Diseñar las tareas y cuestiones
\item 6. Seleccionar y captar a los usuarios
\item 7. Preparar el espacio y los materiales
\item 8. Elaborar una prueba piloto
\item 9. Llevar a cabo el test
\item 10. Analizar los resultados y proponer mejoras
\end{itemize}

\section{Conclusión}
\label{sec:org394a181}
A lo lardo de este taller aprendí que son las pruebas de usuario y su 
funcionalidad, entender como podemos hace la experiencia del usuario mas cómoda 
nos permite dar mas valor a los productos de software que creamos, un software
que permite al usuario hacer las cosas que quiere es mas valioso que un software
que puede hacer muchas cosas en mi opinión

\section{Referencias}
\label{sec:orga22145e}
\printbibliography[heading=none]
\end{document}
